<a href="https://colab.research.google.com/github/GeetanjaliWadhwa/Python-project-/blob/main/Python_project_by_Geetanjali_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

READING DATA USING PANDAS

Storing the data into a dataframe named 'df'

In [ ]:
df = pd.DataFrame(pd.read_csv('/content/train (1).csv'))  #convert the file into data frame
df.head()   #print first 5 rows of data

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
df.shape #number of rows and columns

(891, 12)

HANDLING NULL VALUES

In [ ]:
df.isnull().sum()  #gives number of null values column wise. it returns a pandas series with column names as label index and total count of null values in the column as its value

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

Separating those columns which have more than 35% of the values missing in the dataset

In [ ]:
drop_col= df.isnull().sum()[df.isnull().sum()>(35/100* df.shape[0])]
drop_col

Cabin    687
dtype: int64

In [ ]:
drop_col.index

Index(['Cabin'], dtype='object')

In [ ]:
df.drop(drop_col.index, axis=1, inplace=True)
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [ ]:
df.fillna(df.mean(),inplace=True) #fillna fills the cells with specific value. we filled those cells with mean of all values
df.isnull().sum()  #since Embarked has string values and we can't calculate its mean, therefore no change

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [ ]:
df['Embarked'].describe()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

count - no. of non null values

unique - no. of unique values

top- element with max frequency

freq- freq of top element

In [ ]:
df['Embarked'].fillna('S', inplace= True)
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [ ]:
df.corr()  #correlation between different columns

             PassengerId  Survived    Pclass  ...     SibSp     Parch      Fare
PassengerId     1.000000 -0.005007 -0.035144  ... -0.057527 -0.001652  0.012658
Survived       -0.005007  1.000000 -0.338481  ... -0.035322  0.081629  0.257307
Pclass         -0.035144 -0.338481  1.000000  ...  0.083081  0.018443 -0.549500
Age             0.033207 -0.069809 -0.331339  ... -0.232625 -0.179191  0.091566
SibSp          -0.057527 -0.035322  0.083081  ...  1.000000  0.414838  0.159651
Parch          -0.001652  0.081629  0.018443  ...  0.414838  1.000000  0.216225
Fare            0.012658  0.257307 -0.549500  ...  0.159651  0.216225  1.000000

[7 rows x 7 columns]

if plot is scattered, correlation is a small number

if plot is concentrated on a stright line, correlation has higher value

for y=x line, correlation =1

for y=-x, correlation = -1

for scattered graph, correlation is zero approximately


from the table, we can see that the corelation between fare and pclass is good (fare changes according to the pcell)

In [ ]:
df['FamilySize']=df['SibSp']+ df['Parch']
df.drop(['SibSp','Parch'], axis=1, inplace=True)
df.corr()

             PassengerId  Survived    Pclass       Age      Fare  FamilySize
PassengerId     1.000000 -0.005007 -0.035144  0.033207  0.012658   -0.040143
Survived       -0.005007  1.000000 -0.338481 -0.069809  0.257307    0.016639
Pclass         -0.035144 -0.338481  1.000000 -0.331339 -0.549500    0.065997
Age             0.033207 -0.069809 -0.331339  1.000000  0.091566   -0.248512
Fare            0.012658  0.257307 -0.549500  0.091566  1.000000    0.217138
FamilySize     -0.040143  0.016639  0.065997 -0.248512  0.217138    1.000000

Sibsp: number of siblings/spouses aboard

Parch: Number of Parents/Childern aboard

We created a new column 'FamilySize' by combining these two

From the above table we can conclude that FamilySize does not have much correlance with survival rate.

correlation between pclass ans survived is good. 
Negative value implies it was good for lower pclass (3), survival rate is less and for higher pclass (1&2) , survival rate is more

Let's check if 'the person was alone or not' can affect the survival rate.

In [ ]:
df['Alone'] = [0 if df['FamilySize'][i]>0 else 1 for i in df.index]
df.head()

   PassengerId  Survived  Pclass  ... Embarked FamilySize  Alone
0            1         0       3  ...        S          1      0
1            2         1       1  ...        C          1      0
2            3         1       3  ...        S          0      1
3            4         1       1  ...        S          1      0
4            5         0       3  ...        S          0      1

[5 rows x 11 columns]

In [ ]:
df.groupby(['Alone'])['Survived'].mean() #for each value of alone, it will calculate the mean of survived people

Alone
0    0.505650
1    0.303538
Name: Survived, dtype: float64

If the person was alone, he/she has less chance of surviving

In [ ]:
df[['Alone','Fare']].corr()

          Alone      Fare
Alone  1.000000 -0.271832
Fare  -0.271832  1.000000

If the person was not alone, the chance of high ticket price is higher

negative correlation implies for Alone =0, Fare has higher value

In [ ]:
df['Sex']=[0 if df['Sex'][i]=='male' else 1 for i in df.index] #1 for female, 0 for male
df.groupby(['Sex'])['Survived'].mean()

Sex
0    0.188908
1    0.742038
Name: Survived, dtype: float64

It shows female passengers have more chances of surviving than male passengers.

i.e., women were prioritized over men.

In [ ]:
df.groupby(['Embarked'])['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.339009
Name: Survived, dtype: float64

It shows that survival rate was maximum for passengers with Embarked code as 'C' and minimum for passengers with code 'S'

**CONCLUSION**



*   Female passengers were prioritized over men.
*   People with high class or rich people have higher survival rate than others. The hierarichy might have been followed while saving the passengers.

*   Passengers travelling with their family have higher survival rate.
*   Passengers who boarded the ship at Cherbourg, survived more in proportion than the others.